{
  "architectures": [
    "Glm4MoeLiteForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dtype": "bfloat16",
  "eos_token_id": [
    154820,
    154827,
    154829
  ],
  "first_k_dense_replace": 1,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 10240,
  "kv_lora_rank": 512,
  "max_position_embeddings": 202752,
  "mlp_layer_types": [
    "dense",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse"
  ],
  "model_type": "glm4_moe_lite",
  "moe_intermediate_size": 1536,
  "n_group": 1,
  "n_routed_experts": 64,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 20,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 47,
  "num_key_value_heads": 20,
  "num_nextn_predict_layers": 1,
  "pad_token_id": 154820,
  "partial_rotary_factor": 1.0,
  "pretraining_tp": 1,
  "q_lora_rank": 768,
  "qk_head_dim": 256,
  "qk_nope_head_dim": 192,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_interleave": true,
  "rope_parameters": {
    "partial_rotary_factor": 1.0,
    "rope_theta": 1000000,
    "rope_type": "default"
  },
  "routed_scaling_factor": 1.8,
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "transformers_version": "5.0.0rc3",
  "use_cache": true,
  "v_head_dim": 256,
  "vocab_size": 154880
}
